app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'admin@gmail.com'
 LIMIT 1
---
    public function login()
    {
        if ($this->request->getMethod() === 'post') {
            $ipAddress = $this->request->getIPAddress();
            $attemptsCount = $this->loginAttemptModel->getAttemptsCount($ipAddress, $this->lockoutTime);

            // Cek apakah sudah melebihi batas percobaan
            if ($attemptsCount >= $this->maxAttempts) {
                $lastAttempt = $this->loginAttemptModel->where('ip_address', $ipAddress)
                    ->orderBy('attempt_time', 'DESC')
                    ->first();

                if ($lastAttempt) {
                    $timeLeft = ceil((strtotime($lastAttempt['attempt_time']) + ($this->lockoutTime * 60) - time()) / 60);
                    if ($timeLeft > 0) {
                        return redirect()->back()->with('error', "Terlalu banyak percobaan login. Silakan coba lagi dalam {$timeLeft} menit.");
                    } else {
                        // Reset attempts jika waktu tunggu sudah habis
                        $this->loginAttemptModel->clearAttempts($ipAddress);
                    }
                }
            }

            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            $user = $this->userModel->where('username', $username)->first();