app/Controllers/BeritaController.php

SELECT *
FROM `berita`
ORDER BY `tgl_input` DESC
---
  public function show_berita()
  {
    $data = [
      'title' => 'Berita BEM FST',
      'berita' => $this->beritaModel->orderBy('tgl_input', 'DESC')->findAll()