app/Controllers/Dashboard.php

    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $data = [
            'title' => 'Dashboard',
            'total_users' => $this->userModel->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `users`