app/Controllers/GaleriController.php

SELECT *
FROM `galeri`
---
    public function index()
    {
        $data = [
            'title' => 'Galeri',
            'galeri' => $this->galeriModel->findAll()

INSERT INTO `galeri` (`judul`, `deskripsi`, `upload`, `created_at`, `updated_at`) VALUES ('Ketua Umum Bem Fst Ubudiyah ', 'dsdssdffss', '1747936394_e6d1480a95f2181dff82.jpg', '2025-05-22 17:53:14', '2025-05-22 17:53:14')
---
    public function store()
    {
        // Validasi input
        $rules = [
            'judul' => 'required',
            'deskripsi' => 'required',
            'upload' => 'uploaded[upload]|max_size[upload,2048]|is_image[upload]|mime_in[upload,image/jpg,image/jpeg,image/png]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Upload file
        $foto = $this->request->getFile('upload');
        $namaFoto = $foto->getRandomName();
        $foto->move('uploads/galeri', $namaFoto);

        // Simpan data
        $this->galeriModel->save([
            'judul' => $this->request->getPost('judul'),
            'deskripsi' => $this->request->getPost('deskripsi'),
            'upload' => $namaFoto
        ]);