app/Controllers/Home.php

    public function index()
    {
        $programKerjaModel = new ProgramKerjaModel();
        $program_kerja = $programKerjaModel->findAll();
---
SELECT *
FROM `program_kerja`

    public function programKerja()
    {
        $programKerjaModel = new \App\Models\ProgramKerjaModel();
        $data = [
            'title' => 'Program Kerja BEM FST',
            'program_kerja' => $programKerjaModel->findAll()
---
SELECT *
FROM `program_kerja`

    public function strukturOrganisasi()
    {
        $strukturOrganisasiModel = new StrukturOrganisasiModel();
        $data = [
            'title' => 'Struktur Organisasi BEM FST',
            'struktur_organisasi' => $strukturOrganisasiModel->findAll()
---
SELECT *
FROM `struktur_organisasi`

    public function galeri()
    {
        $data = [
            'title' => 'Galeri BEM FST',
            'galeri' => $this->galeriModel->orderBy('id', 'DESC')->findAll()
---
SELECT *
FROM `galeri`
ORDER BY `id` DESC