app/Controllers/ProgramKerja.php

SELECT *
FROM `program_kerja`
---
  public function index()
  {
    // Hilangkan pengecekan session jika ingin halaman publik (frontend) bisa akses
    $data = [
      'title' => 'Program Kerja',
      'program_kerja' => $this->programKerjaModel->findAll()

INSERT INTO `program_kerja` (`nama_program_kerja`, `tujuan_kegiatan`, `sasaran`, `target_pelaksanaan`, `keterangan`, `created_at`, `updated_at`) VALUES ('dsds', 'dd', 'sasa', 'dsd', 'sdsd', '2025-05-19 08:28:52', '2025-05-19 08:28:52')
---
  public function store()
  {
    if (!$this->validate($this->programKerjaModel->validationRules, $this->programKerjaModel->validationMessages)) {
      return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
    }

    $data = [
      'nama_program_kerja' => $this->request->getPost('nama_program_kerja'),
      'tujuan_kegiatan' => $this->request->getPost('tujuan_kegiatan'),
      'sasaran' => $this->request->getPost('sasaran'),
      'target_pelaksanaan' => $this->request->getPost('target_pelaksanaan'),
      'keterangan' => $this->request->getPost('keterangan')
    ];

    $this->programKerjaModel->insert($data);