app/Controllers/User.php

    public function index()
    {
        if (!session()->get('logged_in') || session()->get('level') != 'super_admin') {
            return redirect()->to('/login');
        }

        $data = [
            'title' => 'Manajemen User',
            'users' => $this->userModel->findAll(),
---
SELECT *
FROM `users`

    public function edit($id)
    {
        if (!session()->get('logged_in') || session()->get('level') != 'super_admin') {
            return redirect()->to('/login');
        }

        $user = $this->userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '11'