app/Models/LoginAttemptModel.php

  public function addAttempt($ipAddress)
  {
    $data = [
      'ip_address' => $ipAddress,
      'attempt_time' => date('Y-m-d H:i:s')
    ];
    return $this->insert($data);
---
INSERT INTO `login_attempts` (`ip_address`, `attempt_time`, `created_at`, `updated_at`) VALUES ('::1', '2025-05-20 16:50:40', '2025-05-20 16:50:40', '2025-05-20 16:50:40')

  public function getAttemptsCount($ipAddress, $minutes = 1)
  {
    $time = date('Y-m-d H:i:s', strtotime("-{$minutes} minutes"));
    return $this->where('ip_address', $ipAddress)
      ->where('attempt_time >=', $time)
      ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `login_attempts`
WHERE `ip_address` = '::1'
AND `attempt_time` >= '2025-05-20 16:49:40'

  public function clearAttempts($ipAddress)
  {
    return $this->where('ip_address', $ipAddress)->delete();
---
DELETE FROM `login_attempts`
WHERE `ip_address` = '::1'